---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
source: html/a890e0c6-1cf9-1943-13dc-824575bcec49.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor Method

Constructs a copy of source object.

## Syntax (C#)
```csharp
public PointCloudOverrideSettings(
	PointCloudOverrideSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings`) - Source object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null